#  元组就是不可变的列表, 元组使用()表示, 元素与元素之间使用逗号隔开, 数据类型没有限制, 只读列表
# 清朝皇帝 (努尔哈赤, 皇太极, 顺治, 康熙, 雍正, 乾隆)

# huang = ("努尔哈赤", "皇太极", "顺治", "康熙", "雍正", "乾隆", "嘉庆", "道光", "光绪", "咸丰")
# # huang[1] = "朱元璋" # 报错 'tuple' object does not support item assignment
# print(huang)

# 小括号在计算机里还表示算数优先级
# print((8+3)*7)

# tu = (1,) # 加了逗号, 就是元组了
# tu = ("哈哈","呵呵","嘿嘿",)
# print(type(tu))
# lst = list()  # []
# tu = tuple()  # 空元组

# 元组也有索引和切片 和列表一样和字符串也一样
# tu = ("iphone", "nokia", "砸核桃", "Lenovo", "HTC", "Honor")
# print(tu[-1])
# print(tu[1:3])
# print(tu[1:5:2])

# 不可变指的是第一层元素不可变, 第二层取决于你的数据类型
# tu = (1, 2, 5, ["胡辣汤", "滋滋冒油的大猪蹄子", "酱猪肘", "香喷喷的米饭", "脆皮炸鸡"])
# tu[3].append("锅包肉")
# print(tu)

# tu = ("孙悟空", "白骨精", "哪吒", "二师兄", "妲己")
#
# for el in tu:  # element 元素
#     print(el)



